/*Известно, что любое чётное число, большее 2, представимо в виде суммы
2 простых чисел, причём таких разложений может быть несколько. Впервые 
гипотезу о существовании данного разложения сформулировал математик Х. 
Гольдбах.
Требуется написать программу, производящую согласно утверждению 
Гольдбаха, разложение заданного чётного числа. Из всех пар простых 
чисел, сумма которых равна заданному числу, требуется найти пару, 
содержащую наименьшее простое число.
Входные данные
Входной файл INPUT.TXT содержит чётное число N (4 ≤ N ≤ 998).
Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести два простых числа, сумма 
которых равна числу N. Первым выводится наименьшее число.
*/
Console.WriteLine("Hello, arrays, Methods and Goldbach!");
uint value = 6;
//uint result = 3+3

double
