/*
Написать методы для добавления элемента в начало массива, в конец  
массива и по указанному индексу.
*/
Console.WriteLine("Hello, Ref, Methods, Arrays & Generics!");
